cases/HPC_motorbike/Medium/v1912/system/mirrorMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          mirrorMeshDict;
}

planeType       pointAndNormal;

pointAndNormalDict
{
    point           ( 0 4 0 );
    normal          ( 0 1 0 ); 
    basePoint       ( 0 4 0 );
}

planeEquationDict
{
    a               0;
    b               1;
    c               0;
    d               0;
}

embeddedPointsDict
{
    point1          ( 0 0 0 );
    point2          ( 1 0 0 );
    point3          ( 0 0 1 );
}

planeTolerance  0.001;


// ************************************************************************* //
